tap 'caskroom/cask'
tap 'caskroom/versions'
tap 'homebrew/boneyard'
tap 'homebrew/bundle'
tap 'homebrew/dupes'
tap 'homebrew/php'
tap 'homebrew/services'
tap 'homebrew/versions'
tap 'homebrew/x11'

brew 'bash'
brew 'bash-completion'
brew 'sqlite'
brew 'openssl'
brew 'python'
brew 'libmagic', args: ['with-python']
brew 'cmake'
brew 'mysql'
brew 'postgresql'
brew 'gcc'
brew 'git'
brew 'go'
brew 'docker'
brew 'boot2docker'
brew 'imagemagick', args: ['with-webp']
brew 'cask'
brew 'coreutils'
brew 'ffmpeg', args: ['with-fdk-aac', 'with-ffplay', 'with-freetype', 'with-openjpeg', 'with-theora', 'with-tools', 'with-libvpx']
brew 'gnu-sed', args: ['with-default-names']
brew 'irssi'
brew 'mongodb'
brew 'node'
brew 'nvm'
brew 'rbenv'
brew 'redis'
brew 'rethinkdb'
brew 'vim', args: ['with-lua', 'override-system-vi']
brew 'wget', args: ['with-iri']
brew 'caskroom/cask/brew-cask'

cask '1password'
cask 'dropbox'
cask 'filezilla'
cask 'firefox'
cask 'google-chrome'
cask 'imagealpha'
cask 'imageoptim'
cask 'iterm2'
cask 'slack'
cask 'slate'
cask 'spotify'
cask 'virtualbox'
