tap 'homebrew/bundle'
tap 'homebrew/services'

brew 'bash'
brew 'bash-completion'
brew 'openssl'
brew 'python'
brew 'mysql'
brew 'postgresql'
brew 'gcc'
brew 'git'
brew 'go'
brew 'cask'
brew 'coreutils'
brew 'gnu-sed'
brew 'node'
brew 'nvm'
brew 'rbenv'
brew 'redis'
brew 'vim'
brew 'wget', args: ['with-iri']
brew 'kubectl'
brew 'jq'
brew 'gnupg'
brew 'the_silver_searcher'
brew 'hub'
brew 'grep'
brew 'fd'
brew 'diff-so-fancy'
brew 'difftastic'

# Apps not here
# 1. 1Password (outdated version)
# 2. Bear Notes
# 3. Cointick

cask 'alfred' # Add licence and workflows
cask 'iterm2' # Add profile
cask 'spotify' # Login
cask 'whatsapp' # Login
