tap 'caskroom/cask'
tap 'caskroom/versions'
tap 'homebrew/boneyard'
tap 'homebrew/bundle'
tap 'homebrew/services'

brew 'bash'
brew 'bash-completion'
brew 'sqlite'
brew 'openssl'
brew 'python'
brew 'libmagic', args: ['with-python']
brew 'cmake'
brew 'mysql'
brew 'postgresql'
brew 'gcc'
brew 'git'
brew 'go'
brew 'imagemagick', args: ['with-webp']
brew 'cask'
brew 'coreutils'
brew 'gnu-sed', args: ['with-default-names']
brew 'irssi'
brew 'mongodb'
brew 'node'
brew 'nvm'
brew 'rbenv'
brew 'redis'
brew 'rethinkdb'
brew 'vim', args: ['with-lua', 'override-system-vi']
brew 'wget', args: ['with-iri']
brew 'kubectl'
brew 'jq'
brew 'watch'
brew 'terraform'
brew 'ansible'
brew 'gnupg'
brew 'the_silver_searcher'
brew 'hub'
brew 'ffmpeg', args: ['with-fdk-aac', 'with-ffplay', 'with-freetype', 'with-openjpeg', 'with-theora', 'with-tools', 'with-libvpx']

# Apps not here
# 1. 1Password (outdated version)
# 2. Bear Notes
# 3. Cointick

cask 'appgate-sdp-client' # Login
cask 'alfred' # Add licence and workflows
cask 'dropbox'
cask 'iterm2' # Add profile
cask 'slate'
cask 'spotify' # Login
cask 'slack' # Login
cask 'whatsapp' # Login
cask 'google-chrome'
cask 'sublime-text'
cask 'keybase'
cask 'https://raw.githubusercontent.com/caskroom/homebrew-cask/fda3b24db9052dcbffa84e40138e355e88343dab/Casks/1password.rb'
